# Кортежи

card = ('7','пик')
print(card)

print(('7','червей') < ('7','треф'))

print(('7',2) < ('7','треф')) # так нельзя сравнивать выдаст ошибку

card = ('7','пик')

gps = (12.02345) # координаты карты

# Присваивание кортежей
a, b = 1, 2 # справа кортеж из значении
a, b = (2,1)
print(a)

a = 1
b = 2
a, b = (2,1)
print(a,b)

a, b = 1,2 # теперь a == 1 and b == 2
a, b = b, a # теперь a = 2 and b == 1

a,b,c = 1,2
print(a,b)

# кортеж, стоящий справа от =, прямо на этой же строчке. Но можно заготовить его и заранее:

# cards = [('7', 'пик'), ('Д', 'треф'), ('Т', 'пик')]
# value, suit = cards[0]
# print('Достоинство карты:', value)
# print('Масть карты:', suit)

set()
tuple()
str()
list()

a  = list('Hello')
print(a)

a = str('Hello')
print(a)

a = (1, 2, 3)
a = list(a)
a[2] = 123
a = tuple()
print(a)
